tap "beeftornado/rmtree"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "qmk/qmk"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Color-highlighted diff(1) output
brew "colordiff"
# Configurable talking characters in ASCII art
brew "cowsay"
# Banner-like program prints strings as ASCII art
brew "figlet"
# Distributed revision control system
brew "git"
# Improved top (interactive process viewer)
brew "htop"
# Platform built on V8 to build network applications
brew "node"
# Cross-shell prompt for astronauts
brew "starship"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Quantum Mechanical Keyboard (QMK) Firmware
brew "qmk/qmk/qmk"
# Application launcher and productivity software
cask "alfred"
# Application uninstaller
cask "appcleaner"
# Tool to flash OS images to SD cards & USB drives
cask "balenaetcher"
# Scriptable scratchpad for developers
cask "boop"
# Remove junk and unused files
cask "ccleaner"
# Server and cloud storage browser
cask "cyberduck"
# Voice and text chat software
cask "discord"
# Text editor
cask "emacs"
# Typeface made for developers
cask "font-jetbrains-mono"
# Web browser
cask "google-chrome"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Text editor
cask "macvim"
# Native desktop app for Messenger (formerly Facebook Messenger)
cask "messenger"
# Minimal installer for conda
cask "miniconda"
# QuickLook plug-in that renders source code with syntax highlighting
cask "qlcolorcode"
# QuickLook generator for Markdown files
cask "qlmarkdown"
cask "qlstephen"
# Toolbox companion for QMK Firmware
cask "qmk-toolbox"
cask "quicklook-json"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# Video game digital distribution service
cask "steam"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Open-source version of the X.Org X Window System
cask "xquartz"
# Video communication and virtual meeting platform
cask "zoom"
